app/Controllers/AuthController.php

    public function login()
    {
        $model = new UsuarioModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $usuario = $model->where('email', $email)->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'enzo@gmail.com'
 LIMIT 1