app/Controllers/CompraController.php

SELECT *
FROM `productos`
WHERE `productos`.`id_producto` = '4'
---
public function formulario()
{
    $id_producto = $this->request->getPost('id_producto');

    $productoModel = new ProductoModel();
    $producto = $productoModel->find($id_producto);