app/Controllers/ProductoController.php

    public function index()
    {
        if (!session()->get('usuario_id')) {
            return redirect()->to('/login');
        }

        $productoModel = new ProductoModel();
        $data['productos'] = $productoModel->findAll();
---
SELECT *
FROM `productos`